src/DataProcessors/ЗаполнитьДаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>ЗаполнитьДаты</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

src/InformationRegisters/Календарь.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Календарь</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Выходной</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/DataProcessors/ЗаполнитьДаты/Forms/Форма/Ext/Form/Module.bsl
&НаСервереБезКонтекста
Процедура ЗаполнитьКалендарьНаСервере(ДатаНачала, ДатаОкончания)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Календарь.Дата КАК Дата,
		|	Календарь.Выходной КАК Выходной
		|ИЗ
		|	РегистрСведений.Календарь КАК Календарь
		|ГДЕ
		|	Календарь.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания";
	
	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		ЗаписиРегистра = РегистрыСведений.Календарь.СоздатьНаборЗаписей();
		ЗаписиРегистра.Отбор.Дата.Установить(ВыборкаДетальныеЗаписи.Дата);
		Попытка
			ЗаписиРегистра.Записать();
		Исключение
			ТехДетали = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			ЗаголовокОшибки = "Ошибка записи в регистр сведений ""Календарь""";
			ЗаписьЖурналаРегистрации(ЗаголовокОшибки, УровеньЖурналаРегистрации.Ошибка, ,,ТехДетали);
		КонецПопытки;
		
	КонецЦикла;
	
	ДатаВРегистр = ДатаНачала;
	СекундВДне = 24*60*60;
	Пока ДатаВРегистр <= ДатаОкончания Цикл
		
		ЗаписьРегистра = РегистрыСведений.Календарь.СоздатьМенеджерЗаписи();
		ЗаписьРегистра.Дата = ДатаВРегистр;
		лДеньНедели = ДеньНедели(ДатаВРегистр);
		Если лДеньНедели = 6
			ИЛИ лДеньНедели = 7
		Тогда
			ЗаписьРегистра.Выходной =Истина;
		КонецЕсли;
		Попытка
			ЗаписьРегистра.Записать();
		Исключение 
			ТехДетали = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			ЗаголовокОшибки = "Ошибка записи в регистр сведений ""Календарь""";
			ЗаписьЖурналаРегистрации(ЗаголовокОшибки, УровеньЖурналаРегистрации.Ошибка, ,,ТехДетали);
		КонецПопытки;
		
		ДатаВРегистр = ДатаВРегистр + СекундВДне;
		
	КонецЦикла;
	
	

	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьКалендарь(Команда)
	ЗаполнитьКалендарьНаСервере(Период.ДатаНачала, Период.ДатаОкончания);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТекДата = ТекущаяДатаСеанса();
	Период.ДатаНачала = НачалоГода(ТекДата);
	Период.ДатаОкончания = КонецГода(ТекДата);
	
КонецПроцедуры
